<a href="https://colab.research.google.com/github/SAGO-20/SQL/blob/main/Practice_4_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# EDINBURGH BUS ROUTE

[Source](https://sqlzoo.net/wiki/Self_join)

**How many stops are in the database**

In [ ]:
SELECT COUNT(id)
FROM stops

**Find the id value for the stop 'Craiglockhart'**

In [ ]:
SELECT id
FROM stops
WHERE name = 'Craiglockhart'

**Give the id and the name for the stops on the '4' 'LRT' service**

In [ ]:
SELECT id, name
FROM stops
JOIN route
ON stops.id = route.stop
WHERE num = '4' AND company = 'LRT'

**The query shown gives the number of routes that visit either London Road (149) or Craiglockhart (53). Run the query and notice the two services that link these stops have a count of 2. Add a HAVING clause to restrict the output to these two routes**

In [ ]:
SELECT company, num, COUNT(*)
FROM route WHERE stop=149 OR stop=53
GROUP BY company, num
HAVING COUNT(*) = 2

**Execute the self join shown and observe that b.stop gives all the places you can get to from Craiglockhart, without changing routes. Change the query so that it shows the services from Craiglockhart to London Road.**

In [ ]:
SELECT a.company, a.num, a.stop, b.stop
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
WHERE a.stop=53 AND b.stop = 149

**The query shown is similar to the previous one, however by joining two copies of the stops table we can refer to stops by name rather than by number. Change the query so that the services between 'Craiglockhart' and 'London Road' are shown.**

In [ ]:
SELECT r1.company,r1.num,s1.name,s2.name
FROM route as r1 JOIN route as r2 ON (r1.num = r2.num AND r1.company = r2.company)
                 JOIN stops as s1 ON s1.id = r1.stop
                 JOIN stops as s2 ON s2.id = r2.stop
WHERE r1.stop = 53 AND r2.stop = 149

**Give a list of all the services which connect stops 115 and 137 ('Haymarket' and 'Leith')**

In [ ]:
SELECT DISTINCT r1.company,r1.num
FROM route as r1 JOIN route as r2 ON (r1.num = r2.num AND r1.company = r2.company)
WHERE r1.stop = 115 AND r2.stop = 137

**Give a list of the services which connect the stops 'Craiglockhart' and 'Tollcross'**

In [ ]:
SELECT r1.company, r1.num
FROM route as r1 JOIN route as r2 ON (r1.num = r2.num AND r1.company = r2.company)
                 JOIN stops as s1 ON s1.id = r1.stop
                 JOIN stops as s2 ON s2.id = r2.stop
WHERE s1.name = 'Craiglockhart' AND s2.name = 'Tollcross'

**Give a distinct list of the stops which may be reached from 'Craiglockhart' by taking one bus, including 'Craiglockhart' itself, offered by the LRT company. Include the company and bus no. of the relevant services.**

In [ ]:
SELECT DISTINCT s2.name,r1.company, r1.num
FROM route as r1 JOIN route as r2 ON r1.num = r2.num AND r1.company = r2.company
                 JOIN stops as s1 ON s1.id = r1.stop
                 JOIN stops as s2 ON s2.id = r2.stop
WHERE s1.name = 'Craiglockhart' AND r1.company = 'LRT'

**Find the routes involving two buses that can go from Craiglockhart to Lochend.
Show the bus no. and company for the first bus, the name of the stop for the transfer,
and the bus no. and company for the second bus.**

In [ ]:
SELECT C.num,C.company,C.name,L.num, L.company
FROM
     (SELECT r1.num, r1.company, s2.name
      FROM route as r1 JOIN route as r2 ON (r1.num = r2.num AND r1.company = r2.company)
                       JOIN stops as s1 ON s1.id = r1.stop
                       JOIN stops as s2 ON s2.id = r2.stop
      WHERE s1.name = 'Craiglockhart' AND s2.name <> 'Craiglockhart') as C
JOIN
    (SELECT r3.num, r3.company, s4.name
     FROM route as r3 JOIN route as r4 ON (r3.num = r4.num AND r3.company = r4.company)
                      JOIN stops as s3 ON s3.id = r3.stop
                      JOIN stops as s4 ON s4.id = r4.stop
     WHERE s3.name = 'Lochend' AND s4.name <> 'Lochend'
) as L
ON (C.name = L.name)